<template>
    <section class="coverage-section">
        <img src="../public/decor-loader-bottom.png" alt="" class="decor decor--loader" />
        <img src="../public/decor-truck-right.png" alt="" class="decor decor--truck" />

        <div class="coverage-container">
            <h2 class="coverage-title">
                Заказать услугу «Грузчики» Вы можете круглосуточно по всей территории Москвы и Московской области
            </h2>

            <div class="text-block">
                <p class="cities-text">
                    Балашиха, Бронницы, Видное, Волоколамск, Воскресенск, Дзержинский, Дмитров, Долгопрудный,
                    Домодедово, Дубна, Егорьевск, Жуковский, Зарайск, Истра, Кашира, Клин, Коломна, Королёв, Котельники,
                    Красногорск, Лобня, Лосино-Петровский, Лотошино, Луховицы, Лыткарино, Люберцы, Можайск, Мытищи,
                    Наро-Фоминск, Ногинск, Одинцово, Орехово-Зуево, Павловский Посад, Подольск, Пушкино, Раменское,
                    Реутов, Руза, Сергиев Посад, Серебряные Пруды, Серпухов, Солнечногорск, Ступино, Талдом, Фрязино,
                    Химки, Черноголовка, Чехов, Шатура, Шаховская, Щёлково, Электросталь, Боброво, Бутово, Горки
                    Ленинские, Дрожжино, Лопатино, Измайлово, Новодрожжино, Сычёво
                    <span class="hidden-part" :class="{ 'is-visible': isTextOpen }">
                        , Осташёво, Белоозёрский, Яхрома, Новосиньково, Некрасовский, Деденево, Шувое, Чулки-Соколово,
                        Поселок 40 лет Октября, Масловский, Гололобово, Мендюкино, Макеево, Дедовск, Глебовский,
                        Павловская Слобода, Высоковск, Озёры, Нахабино, Путилково, Свердловский, Красная Пойма,
                        Белоомут, Октябрьский, Малаховка, Томилино, Красково, Уваровка, Калининец, Селятино, Апрелевка,
                        Старая Купавна, Электроугли, Голицыно, Большие Вязёмы, Кубинка, Звенигород, Куровское,
                        Ликино-Дулёво, Дрезна, Большие Дворы, Ивантеевка, Софрино, Красноармейск, Правдинский, Удельная,
                        Быково, Ильинский, Тучково, Пересвет, Краснозаводск, Хотьково, Протвино, Пущино, Менделеево,
                        Запрудня, Вербилки, Северный, Рошаль, Авиамоторная, Автозаводская, Академическая,
                        Александровский сад, Алексеевская, Алма-Атинская, Алтуфьево, Аминьевская, Андроновка, Аннино,
                        Арбатская, Аэропорт, Бабушкинская, Багратионовская, Балтийская, Баррикадная, Бауманская,
                        Беговая, Белокаменная, Беломорская, Белорусская, Беляево, Бибирево, Библиотека имени Ленина,
                        Битцевский парк, Борисово, Боровицкая, Боровское шоссе, Ботанический сад, Братиславская, Бульвар
                        Адмирала Ушакова, Бульвар Дмитрия Донского, Бульвар Рокоссовского, Бунинская аллея, Бутырская,
                        Варшавская, ВДНХ, Верхние Котлы, Верхние Лихоборы, Владыкино, Водный стадион, Войковская,
                        Волгоградский проспект, Волжская, Волоколамская, Воробьёвы горы, Воронцовская, Выставочная,
                        Выставочный центр, Выхино, Говорово, Давыдково, Деловой центр, Динамо, Дмитровская,
                        Добрынинская, Домодедовская, Достоевская, Дубровка, Жулебино, ЗИЛ, Зорге, Зюзино, Зябликово,
                        Измайлово, Измайловская, Калужская, Кантемировская, Каховская, Каширская, Киевская, Китай-город,
                        Кленовый Бульвар, Кожуховская, Коломенская, Коммунарка, Комсомольская, Коньково, Коптево,
                        Косино, Котельники, Красногвардейская, Краснопресненская, Красносельская, Красные Ворота,
                        Крестьянская застава, Кропоткинская, Крылатское, Крымская, Кузнецкий Мост, Кузьминки,
                        Кунцевская, Курская, Кутузовская, Ленинский проспект, Лермонтовский проспект, Лесопарковая,
                        Лефортово, Лихоборы, Локомотив, Ломоносовский проспект, Лубянка, Лужники, Лухмановская, Люблино,
                        Марксистская, Марьина Роща, Марьино, Маяковская, Медведково, Международная, Менделеевская,
                        Минская, Митино, Мичуринский проспект, Мнёвники, Молодёжная, Мякинино, Нагатинская, Нагатинский
                        Затон, Нагорная, Народное Ополчение, Нахимовский проспект, Некрасовка, Нижегородская,
                        Новаторская, Новогиреево, Новокосино, Новокузнецкая, Новопеределкино, Новослободская,
                        Новохохловская, Новоясеневская, Новые Черёмушки, Озёрная, Окружная, Окская, Октябрьская,
                        Октябрьское Поле, Ольховая, Орехово, Отрадное, Охотный Ряд, Павелецкая, Панфиловская, Парк
                        культуры, Парк Победы, Партизанская, Первомайская, Перово, Петровский парк,
                        Петровско-Разумовская, Печатники, Пионерская, Планерная, Площадь Гагарина, Площадь Ильича,
                        Площадь Революции, Полежаевская, Полянка, Пражская, Преображенская площадь, Прокшино,
                        Пролетарская, Проспект Вернадского, Проспект Мира, Профсоюзная, Пушкинская, Пятницкое шоссе,
                        Раменки, Рассказовка, Речной вокзал, Рижская, Римская, Ростокино, Румянцево, Рязанский проспект,
                        Савёловская, Саларьево, Свиблово, Севастопольская, Селигерская, Семёновская, Серпуховская,
                        Славянский бульвар, Смоленская, Сокол, Соколиная Гора, Сокольники, Солнцево, Спартак,
                        Спортивная, Сретенский бульвар, Старокачаловская, Стахановская, Стрешнево, Строгино,
                        Студенческая, Сухаревская, Сходненская, Таганская, Тверская, Театральная, Текстильщики,
                        Телецентр, Терехово, Технопарк, Тёплый Стан, Тимирязевская, Третьяковская, Тропарёво, Трубная,
                        Тульская, Тургеневская, Тушинская, Угрешская, Улица 1905 года, Улица Академика Королёва, Улица
                        Академика Янгеля, Улица Горчакова, Улица Дмитриевского, Улица Милашенкова, Улица Сергея
                        Эйзенштейна, Улица Скобелевская, Университет, Филатов Луг, Филёвский парк, Фили, Фонвизинская,
                        Фрунзенская, Ховрино, Хорошёво, Хорошёвская, Царицыно, Цветной бульвар, ЦСКА, Черкизовская,
                        Чертановская, Чеховская, Чистые пруды, Чкаловская, Шаболовская, Шелепиха, Шипиловская, Шоссе
                        Энтузиастов, Щёлковская, Щукинская, Электрозаводская, Юго-Восточная, Юго-Западная, Южная,
                        Ясенево, ЦАО, Арбат, Басманный, Замоскворечье, Красносельский, Мещанский, Пресненский,
                        Таганский, Тверской, Хамовники, Якиманка, САО, Аэропорт, Беговой, Бескудниковский, Войковский,
                        Восточное Дегунино, Головинский, Дмитровский, Западное Дегунино, Коптево, Левобережный,
                        Молжаниновский, Савеловский, Сокол, Тимирязевский, Ховрино, Хорошевский, СВАО, Алексеевский,
                        Алтуфьевский, Бабушкинский, Бибирево, Бутырский, Лианозово, Лосиноостровский, Марфино, Марьина
                        роща, Останкинский, Отрадное, Ростокино, Свиблово, Северное Медведково, Северный, Южное
                        Медведково, Ярославский, ВАО, Богородское, Вешняки, Восточное Измайлово, Восточный, Гольяново,
                        Ивановское, Измайлово, Косино-Ухтомский, Метрогородок, Новогиреево, Новокосино, Перово,
                        Преображенское, Северное Измайлово, Соколиная гора, Сокольники, ЮВАО, Выхино-Жулебино, Капотня,
                        Кузьминки, Лефортово, Люблино, Марьино, Некрасовка, Нижегородский, Печатники, Рязанский,
                        Текстильщики, Южнопортовый, ЮАО, Бирюлево, Восточное, Бирюлево, Западное, Братеево, Даниловский,
                        Донской, Зябликово, Москворечье-Сабурово, Нагатино-Садовники, Нагатинский Затон, Нагорный,
                        Орехово-Борисово Северное, Орехово-Борисово Южное, Царицыно, Чертаново Северное, Чертаново
                        Центральное, Чертаново Южное, ЮЗАО, Академический, Гагаринский, Зюзино, Коньково, Котловка,
                        Ломоносовский, Обручевский, Северное Бутово, Теплый Стан, Черемушки, Южное Бутово, Ясенево, ЗАО,
                        Внуково, Дорогомилово, Крылатское, Кунцево, Можайский, Ново-Переделкино, Очаково-Матвеевское,
                        Проспект Вернадского, Раменки, Солнцево, Тропарево-Никулино, Филевский парк, Фили-Давыдково,
                        СЗАО, Куркино, Митино, Покровское-Стрешнево, Северное Тушино, Строгино, Хорошево-Мневники,
                        Щукино, Южное Тушино, ЗелАО, Крюково, Матушкино, Савелки, Силино, Старое Крюково, ТАО,
                        Щаповское, Троицк, Роговское, Первомайское, Новофёдоровское, Михайлово-Ярцевское,
                        Краснопахорское, Клёновское, Киевский, Вороновское, НАО, Внуковское, Воскресенское, Десеновское,
                        Кокошкино, Марушкинское, Московский, Мосрентген, Рязановское, Сосенское, Филимонковское,
                        Щербинка
                    </span>
                </p>

                <div class="fade-overlay" :class="{ 'is-hidden': isTextOpen }"></div>
            </div>

            <Button :label="isTextOpen ? 'Скрыть' : 'Показать все'" size="sc" outline @click="toggleText" />
        </div>
    </section>
</template>

<script setup lang="ts">
import { ref } from 'vue';

const isTextOpen = ref(false);

const toggleText = () => {
    isTextOpen.value = !isTextOpen.value;
};
</script>

<style scoped lang="scss">
.coverage-section {
    position: relative;
    width: 100%;
    min-height: 312px;
    background-color: #F5F5F5;
    padding-bottom: 60px;
    overflow: hidden;
    margin-bottom: 50px;
}

.decor {
    position: absolute;
    z-index: 1;
    pointer-events: none;
}

.decor--loader {
    top: 8px;
    left: -35px;
    width: 220px;
    height: auto;
}

.decor--truck {
    bottom: 40px;
    right: 0px;
    width: 340px;
    height: auto;
}

.coverage-container {
    position: relative;
    z-index: 2;
    max-width: 1600px;
    margin: 0 auto;
    padding: 0 200px;
    display: flex;
    flex-direction: column;
    align-items: flex-start;
}

.coverage-title {
    font-family: "Euclid Circular A", sans-serif;
    font-weight: 700;
    font-size: 42px;
    line-height: 120%;
    color: #000;
    margin: 0 0 20px 0;
    max-width: 1195px;
}

.text-block {
    position: relative;
    margin-bottom: 30px;
    width: 100%;
    max-width: 1204px;
}

.cities-text {
    font-family: "Euclid Circular A", sans-serif;
    font-weight: 400;
    font-size: 14px;
    line-height: 160%;
    color: #000;
    margin: 0;

    .hidden-part {
        display: none;

        &.is-visible {
            display: inline;
            margin-left: -4px;
        }
    }
}

.fade-overlay {
    position: absolute;
    pointer-events: none;
    transition: opacity 0.3s ease;
    bottom: 0;
    left: 0;
    width: 100%;
    height: 60px;
    background: linear-gradient(to bottom, rgba(245, 245, 245, 0) 0%, #F5F5F5 100%);

    &.is-hidden {
        opacity: 0;
    }
}

@media (max-width: 1300px) {
    .coverage-container {
        padding: 0 40px;
    }

    .coverage-title {
        font-size: 32px;
    }
}

@media (max-width: 768px) {
    .coverage-section {
        padding-bottom: 40px;
        min-height: auto;
    }

    .decor {
        display: none;
    }

    .coverage-container {
        padding: 0 20px;
        align-items: center;
    }

    .coverage-title {
        font-size: 26px;
        margin-bottom: 20px;
        max-width: 100%;
        text-align: left;
        width: 100%;
    }

    .text-block {
        max-width: 100%;
        overflow: hidden;
        margin-bottom: 20px;

        &:has(.hidden-part.is-visible) {
            max-height: none;
            overflow: visible;
        }
    }

    .cities-text {
        font-size: 14px;
        line-height: 150%;
        text-align: left;
    }

    .fade-overlay {
        top: auto;
        bottom: 0;
        left: 0;
        right: auto;
        width: 100%;
        height: 60px;
        background: linear-gradient(to bottom, rgba(245, 245, 245, 0) 0%, #F5F5F5 100%);
    }

    .app-button {
        width: 100%;
        max-width: 343px;
    }
}
</style>